import folium
from .layer import create_groups_layers


attraction_markers = (
    (56.3312128, 44.0094863,'Чкаловская лестница' ,'Чкаловская лестница – архитектурная\
    достопримечательность Нижнего Новгорода.'),
    (56.3272013, 44.0027067,'Нижегородский кремль', 'Нижегородский кремль – древняя крепость и одновременно\
    главная историческая достопримечательность Нижнего Новгорода'),
    (56.3283203, 43.9612056, 'Нижегородская ярмарка' ,'Нижегородская ярмарка — современный выставочный комплекс\
    и один из популярных брендов Нижнего Новгорода.'),
    (56.3230103, 43.9767375, 'Благовещенский монастырь','Благовещенский монастырь — древнейшая обитель \
            в Нижнем Новгороде, основанная в 1221 году.'),
    (56.3110529, 43.9879634, 'Большая Покровская улица','Большая Покровская улица – \
            одна из главных и самых старых улиц Нижнего Новгорода.'),
)

parks_markers = (
    (56.2781, 43.97407, 'Парк Швейцария'),
    (56.26809, 43.91956, 'Парк Дубки'),
    (56.33862, 43.85742, 'Сормовский парк'),
    (56.27, 44.00891, 'Щёлоковский хутор'),
    
)

sber_markers = (
    (56.26657, 44.02483, 'Офис Сбер'),
    (56.27908, 43.95141, 'Отделение СберБанка'),
    (56.30731, 43.93684, 'Отделение СберБанка'),
    (56.32695, 43.95637, 'Отделение СберБанка'),
)


def add_markers_for_layers(layers):

    for x in attraction_markers:
        folium.Marker(
        location=[x[0], x[1]],         
        popup=x[3],
        tooltip=x[2],
        icon=folium.Icon(icon="glyphicon glyphicon-star")
        ).add_to(layers[0])

    for x in sber_markers:
        folium.Marker(
        location=[x[0], x[1]],         
        popup=x[2],
        tooltip=x[2],
        icon=folium.Icon(color='lightgreen', icon="glyphicon glyphicon-bold")
        ).add_to(layers[1])

    for x in parks_markers:
        folium.Marker(
        location=[x[0], x[1]],         
        popup=x[2],
        tooltip=x[2],
        icon=folium.Icon(color='green', icon='glyphicon glyphicon-tree-deciduous')
        ).add_to(layers[2])